# Cable Size Number Of Hot Conductors Property

Source: https://www.revitapidocs.com/2026/534cbcc3-fb63-280d-2b77-eefbd62a91e7.htm

---

| Cable Size Number Of Hot Conductors Property |
| --- |

The number of Hot Conductors.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public int NumberOfHotConductors { get; set; }
```

```
Public Property NumberOfHotConductors As Integer
	Get
	Set
```

```
public:
property int NumberOfHotConductors {
	int get ();
	void set (int value);
}
```

```
member NumberOfHotConductors : int with get, set
```

#### Property Value

Int32 Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for numberOfHotConductors is negative. |

See Also

#### Reference

CableSize Class Autodesk.Revit.DB.Electrical Namespace